tap "charmbracelet/tap"
tap "common-fate/granted"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "redpanda-data/tap"
tap "xo/xo"
brew "act"
brew "atuin"
brew "autoenv"
brew "autojump"
brew "bat"
brew "biome"
brew "black"
brew "buf"
brew "coreutils"
brew "crane"
brew "curl"
brew "d2"
brew "difftastic"
brew "direnv"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "foreman"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghz"
brew "git"
brew "git-lfs"
brew "gitingest"
brew "glow"
brew "gnutls"
brew "go"
brew "golangci-lint"
brew "gradle"
brew "graphviz"
brew "grpcurl"
brew "helix"
brew "helm"
brew "hey"
brew "icu4c@76"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "k9s"
brew "kind"
brew "libgit2@1.7"
brew "libpq"
brew "libxml2"
brew "libxslt"
brew "livekit"
brew "node"
brew "markdownlint-cli"
brew "mysql-client"
brew "neovim"
brew "nvm"
brew "ollama"
brew "openblas"
brew "ripgrep"
brew "opencode"
brew "pam-reattach"
brew "pdm"
brew "pgcli"
brew "pinentry-mac"
brew "pkgconf"
brew "postgresql@16"
brew "protobuf"
brew "pure"
brew "pyenv"
brew "rbenv"
brew "ruff"
brew "rye"
brew "skaffold"
brew "starship"
brew "tailscale"
brew "terraform"
brew "tflint"
brew "tmux"
brew "tree"
brew "uv", link: false
brew "vhs"
brew "walk"
brew "watch"
brew "wget"
brew "xcodegen"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "charmbracelet/tap/crush"
brew "charmbracelet/tap/freeze"
brew "fluxcd/tap/flux"
brew "redpanda-data/tap/redpanda"
brew "xo/xo/usql"
cask "1password"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "antigravity"
cask "arc"
cask "bartender"
cask "charles"
cask "chatgpt-atlas"
cask "claude"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "ghostty"
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "lens"
cask "marta"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "notion"
cask "notion-calendar"
cask "orion"
cask "postico"
cask "postman"
cask "raycast"
cask "rescuetime"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "superhuman"
cask "tableplus"
cask "tidal"
cask "visual-studio-code"
cask "warp"
cask "zed"
cask "zed@preview"
cask "zen"
cask "zoom"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "analytic-signal.preview-pdf"
vscode "apollographql.vscode-apollo"
vscode "arcanis.vscode-zipfs"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bufbuild.vscode-buf"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codium.codium"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "felipecaputo.git-project-manager"
vscode "file-icons.file-icons"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "huggingface.huggingface-vscode"
vscode "jscearcy.rust-doc-viewer"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "nathanridley.autotrim"
vscode "nyxiative.rust-and-friends"
vscode "oderwat.indent-rainbow"
vscode "phind.phind"
vscode "polymeilex.rust-targets"
vscode "qinjia.seti-icons"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rome.rome"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "starkware.cairo"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "terrastruct.d2"
vscode "tfsec.tfsec"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "typespec.typespec-vscode"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhangyue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/opencoreos/forge"
go "github.com/daixiang0/gci"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "go.uber.org/mock/mockgen"
go "github.com/lasorda/protobuf-language-server"
go "honnef.co/go/tools/cmd/staticcheck"
go "golang.org/x/tools/cmd/stringer"
