tap "1password/tap"
tap "bufbuild/buf"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "johanhaleby/kubetail"
tap "mdogan/zulu"
tap "ory/tap"
tap "romkatv/powerlevel10k"
tap "shivammathur/php"
tap "snyk/tap"
tap "speakeasy-api/tap"
tap "stripe/stripe-cli"
brew "act"
brew "aptos"
brew "autoenv"
brew "python@3.11"
brew "autojump"
brew "awscli"
brew "bash"
brew "libssh2"
brew "bat"
brew "openjdk@11"
brew "bazel", link: false
brew "bazelisk"
brew "binutils"
brew "buf"
brew "certstrap"
brew "cmake"
brew "node"
brew "corepack", link: false
brew "coreutils"
brew "ctop"
brew "curl"
brew "cython"
brew "d2"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "exa"
brew "exiftool"
brew "fd"
brew "fontforge"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "goose"
brew "openjdk"
brew "gradle"
brew "graphviz"
brew "grpcurl"
brew "gum"
brew "helix"
brew "helm"
brew "hyperfine"
brew "ipcalc"
brew "iperf3"
brew "jdtls"
brew "jenv"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "libpq"
brew "libssh"
brew "maven"
brew "micromamba"
brew "mysql@8.0"
brew "nasm"
brew "neovim"
brew "newman"
brew "nghttp2"
brew "nmap"
brew "oauth2l"
brew "openapi-generator"
brew "openblas"
brew "openjdk@17"
brew "peco"
brew "phpunit"
brew "pidof"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "pnpm"
brew "postgresql@15"
brew "powerlevel10k"
brew "pre-commit"
brew "protobuf"
brew "pure"
brew "pyenv"
brew "python@3.9"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruff", link: false
brew "rustup-init"
brew "semgrep"
brew "shellcheck"
brew "snyk-cli"
brew "sops"
brew "sqlc"
brew "switchaudio-osx"
brew "tctl"
brew "temporal"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vhs"
brew "vim"
brew "walk"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform-ls"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.4"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "anaconda"
cask "aws-vault"
cask "bartender"
cask "brave-browser"
cask "charles"
cask "cron"
cask "cursor"
cask "discord"
cask "drawio"
cask "expressvpn"
cask "fig"
cask "figma"
cask "firefox"
cask "font-fira-mono-for-powerline"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-powerline-symbols"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keeper-password-manager"
cask "lens"
cask "liteide"
cask "microsoft-teams"
cask "monodraw"
cask "ngrok"
cask "nimble-commander"
cask "notion"
cask "parallels-virtualization-sdk"
cask "paw"
cask "postman"
cask "rapidapi"
cask "raycast"
cask "rescuetime"
cask "slack"
cask "spacedrive"
cask "sublime-merge"
cask "sublime-text"
cask "superhuman"
cask "tableplus"
cask "textmate"
cask "tidal"
cask "vagrant"
cask "visual-studio-code"
cask "warp"
cask "wkhtmltopdf"
cask "xbar"
cask "zed"
cask "zoom"
cask "zulu-jdk8"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "analytic-signal.preview-pdf"
vscode "apollographql.vscode-apollo"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "bufbuild.vscode-buf"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "Codium.codium"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "felipecaputo.git-project-manager"
vscode "file-icons.file-icons"
vscode "formulahendry.code-runner"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "JScearcy.rust-doc-viewer"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mathiasfrohlich.Kotlin"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "NathanRidley.autotrim"
vscode "nyxiative.rust-and-friends"
vscode "oderwat.indent-rainbow"
vscode "panicbit.cargo"
vscode "phind.phind"
vscode "PolyMeilex.rust-targets"
vscode "qinjia.seti-icons"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Starkware.cairo"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "Terrastruct.d2"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
vscode "ZhangYue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
