tap "1password/tap"
tap "aws/tap"
tap "bufbuild/buf"
tap "derailed/k9s"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "oven-sh/bun"
tap "snyk/tap"
brew "act"
brew "atuin"
brew "autoenv"
brew "python"
brew "autojump"
brew "aws-sso-cli"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "libssh2"
brew "bat"
brew "gettext"
brew "glib"
brew "openjdk@11"
brew "bazel"
brew "bazelisk", link: false
brew "binutils"
brew "buf"
brew "certstrap"
brew "clang-format"
brew "cmake"
brew "node"
brew "corepack", link: false
brew "coreutils"
brew "ctop"
brew "curl"
brew "cython"
brew "d2"
brew "deno"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "exa"
brew "exiftool"
brew "fd"
brew "gnutls"
brew "libssh"
brew "ffmpeg"
brew "foreman"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitleaks"
brew "gitui"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "gotop"
brew "openjdk"
brew "gradle"
brew "librsvg"
brew "graphviz"
brew "grpcurl"
brew "gum"
brew "helm"
brew "htop"
brew "hyperfine"
brew "ipcalc"
brew "iperf3"
brew "istioctl"
brew "jdtls"
brew "jenv"
brew "jq"
brew "keyring"
brew "kind"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "libpq"
brew "livekit"
brew "make"
brew "maven"
brew "mysql"
brew "mysql-client"
brew "mysql@8.0"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "newman"
brew "nghttp2"
brew "nmap"
brew "openjdk@17"
brew "peco"
brew "pidof"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "pnpm"
brew "powerlevel10k"
brew "pre-commit"
brew "protobuf"
brew "pure"
brew "pyenv"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruff", link: false
brew "rustup-init"
brew "semgrep"
brew "shellcheck"
brew "skaffold"
brew "snyk-cli"
brew "sops"
brew "sqlc"
brew "switchaudio-osx"
brew "tailscale"
brew "tctl"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "uv"
brew "vhs"
brew "vim"
brew "volta"
brew "walk"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn", link: false
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform-ls"
brew "mike-engel/jwt-cli/jwt-cli"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "adoptopenjdk"
cask "aws-vault"
cask "bartender"
cask "charles"
cask "cursor"
cask "discord"
cask "drawio"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-monaspace"
cask "gitkraken"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "lens"
cask "linear"
cask "liteide"
cask "marta"
cask "microsoft-teams"
cask "monodraw"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "postgres-unofficial"
cask "postman"
cask "raycast"
cask "rescuetime"
cask "slack"
cask "sublime-merge"
cask "sublime-text"
cask "superhuman"
cask "tableplus"
cask "tidal"
cask "vagrant"
cask "visual-studio-code"
cask "warp"
cask "xbar"
cask "zed"
cask "zoom"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "analytic-signal.preview-pdf"
vscode "apollographql.vscode-apollo"
vscode "arcanis.vscode-zipfs"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "bufbuild.vscode-buf"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "codium.codium"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "felipecaputo.git-project-manager"
vscode "file-icons.file-icons"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jscearcy.rust-doc-viewer"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "nathanridley.autotrim"
vscode "nyxiative.rust-and-friends"
vscode "oderwat.indent-rainbow"
vscode "phind.phind"
vscode "polymeilex.rust-targets"
vscode "qinjia.seti-icons"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "starkware.cairo"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "terrastruct.d2"
vscode "tfsec.tfsec"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhangyue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
