{
  "Comment.nvim": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "ale": { "branch": "master" },
  "base46": { "branch": "v2.0" },
  "better-escape.nvim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lua": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "codeium.vim": { "branch": "main" },
  "extensions": { "branch": "v2.0" },
  "friendly-snippets": { "branch": "main" },
  "fzf.vim": { "branch": "master" },
  "github-nvim-theme": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "goyo.vim": { "branch": "master" },
  "indent-blankline.nvim": { "branch": "master" },
  "indentLine": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lightline.vim": { "branch": "master" },
  "limelight.vim": { "branch": "master" },
  "mason.nvim": { "branch": "main" },
  "molokai": { "branch": "master" },
  "nerdtree": { "branch": "master" },
  "nerdtree-git-plugin": { "branch": "master" },
  "nord-vim": { "branch": "main" },
  "null-ls.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-cmp": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-jdtls": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "nvterm": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "rainbow": { "branch": "master" },
  "rust.vim": { "branch": "master" },
  "tagbar": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "tmuxline.vim": { "branch": "master" },
  "ui": { "branch": "v2.0" },
  "vim": { "branch": "master" },
  "vim-devicons": { "branch": "master" },
  "vim-easymotion": { "branch": "master" },
  "vim-floaterm": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gitgutter": { "branch": "main" },
  "vim-go": { "branch": "master" },
  "vim-minimap": { "branch": "master" },
  "vim-polyglot": { "branch": "master" },
  "vim-solarized8": { "branch": "master" },
  "vim-startify": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "which-key.nvim": { "branch": "main" }
}